Repository: MayurSMahajan/transformX
Catalog: lib/l10n/arb/app_*.arb
Languages: es, fr, hi, ja

# counterAppBarTitle
source: Counter
es: Contador
fr: Compteur
hi: काउंटर
ja: カウンター

# goodMorningGreet
source: good morning
es: buenos días
fr: bonjour
hi: सुप्रभात
ja: おはようございます

# goodAfternoonGreet
source: good afternoon
es: buenas tardes
fr: bon après-midi
hi: शुभ दोपहर
ja: こんにちは

# goodEveningGreet
source: good Evening
es: buenas noches
fr: bonsoir
hi: शुभ संध्या
ja: こんばんは

# greatJobHomeText
source: great job
es: gran trabajo
fr: excellent travail
hi: बहुत बढ़िया काम
ja: 素晴らしい仕事

# greatJobHomeDescription
source: last week was your best week, you can do it again!
es: la semana pasada fue tu mejor semana, ¡puedes hacerlo de nuevo!
fr: la semaine dernière a été ta meilleure semaine, tu peux le refaire !
hi: पिछले हफ्ते आपका सबसे अच्छा हफ्ता था, आप फिर से कर सकते हैं!
ja: 先週はあなたのベストウィークでした、もう一度できます！

# couldHaveBeenBetterHomeText
source: could have been better
es: podría haber sido mejor
fr: aurait pu être mieux
hi: बेहतर हो सकता था
ja: もう少し良くできた

# couldHaveBeenBetterHomeDescription
source: you were little off this week, hope you wil be active again
es: estuviste un poco desconectado esta semana, espero que vuelvas a estar activo
fr: tu étais un peu en retrait cette semaine, j'espère que tu seras actif à nouveau
hi: आप इस हफ्ते थोड़े से पिछड़ गए थे, आशा है कि आप फिर से सक्रिय होंगे
ja: 今週は少し調子が悪かったですが、またアクティブになることを願っています

# titleHomeText
source: title
es: título
fr: titre
hi: शीर्षक
ja: タイトル

# streakText
source: streak
es: racha
fr: série
hi: दावा
ja: 連続

# recordText
source: record
es: récord
hi: रिकॉर्ड
ja: 記録

# minText
source: min
hi: मिनट
ja: 分

# idealText
source: ideal
fr: idéal
hi: आदर्श
ja: 理想

# rewardText
source: Reward
es: recompensa
fr: récompense
hi: पुरस्कार
ja: 報酬

# editText
source: edit
es: editar
fr: modifier
hi: संपादित करें
ja: 編集

# nextActionButton
source: Next
es: Siguiente
fr: Suivant
hi: आगामी
ja: 次へ

# startMyHabitActionButton
source: start my habit
es: empezar mi hábito
fr: commencer mon habitude
hi: मेरा आदत शुरू करें
ja: 習慣を始める

# iWillCueText
source: i will
es: lo haré
fr: je vais
hi: मैं करूंगा
ja: 私はするつもりです

# newHabitCuePlaceholder
source: new habit...
es: nuevo hábito...
fr: nouvelle habitude...
hi: नई आदत...
ja: 新しい習慣...

# atCueText
source: at
es: a las
fr: à
hi: पर
ja: で

# timeCuePlaceholder
source: time
es: hora
fr: heure
hi: समय
ja: 時刻

# inCueText
source: in
es: en
fr: dans
hi: में
ja: で

# locationCuePlaceholder
source: location
es: ubicación
fr: emplacement
hi: स्थान
ja: 場所

# iconForYourHabitCueText
source: icon for your habit
es: icono para tu hábito
fr: icône pour votre habitude
hi: आपकी आदत के लिए प्रतीक
ja: 習慣のためのアイコン

# hourCravePlaceholder
source: hour
es: hora
fr: heure
hi: घंटे
ja: 時間

# minDailyTargetCraveText
source: min daily target
es: objetivo diario de min
fr: objectif quotidien en min
hi: मिनट का दैनिक लक्ष्य
ja: 日別目標（分）

# minMinsCravePlaceholder
source: 25 mins
fr: 25 min
hi: 25 मिनट
ja: 25 分

# idealDailyTargetCraveText
source: ideal daily target
es: objetivo diario ideal
fr: objectif quotidien idéal
hi: आदर्श दैनिक लक्ष्य
ja: 理想的な日別目標

# idealMinsCravePlaceholder
source: 60 mins
fr: 60 min
hi: 60 मिनट
ja: 60 分

# afterResposeText
source: after
es: después
fr: après
hi: के बाद
ja: 後で

# currentHabitResponsePlaceholder
source: current habit
es: hábito actual
fr: habitude actuelle
hi: वर्तमान आदत
ja: 現在の習慣

# iWillDoMyHabitResponseText
source: i will do my habit
es: haré mi hábito
fr: je vais faire mon habitude
hi: मैं अपनी आदत करूंगा
ja: 私は習慣を実行します

# butBeforStartingMyHabitResponseText
source: but before starting my habit
es: pero antes de empezar mi hábito
fr: mais avant de commencer mon habitude
hi: लेकिन अपनी आदत शुरू करने से पहले
ja: ただし、習慣を開始する前に

# iWillDo1MinRitualResponseText
source: i will do a 1 min-Ritual
es: haré un ritual de 1 min
fr: je vais faire un rituel de 1 minute
hi: मैं 1 मिनट का रीति-क्रिया करूंगा
ja: 1分間の儀式を行います

# setUpMyDeskResponseText
source: set up myDesk
es: prepararé mi escritorio
fr: préparer mon bureau
hi: मेरा मेज तैयार करूंगा
ja: 私のデスクをセットアップします

# afterIHitMyDailyGoalRewardText
source: after I hit my daily goal
es: después de alcanzar mi objetivo diario
fr: après avoir atteint mon objectif quotidien
hi: मैं अपने दैनिक लक्ष्य को पूरा करने के बाद
ja: 日々の目標を達成した後

# iWillRewardMyselfRewardText
source: i will reward myself
es: me recompensaré
fr: je vais me récompenser
hi: मैं अपने आप को पुरस्कृत करूंगा
ja: 自分にご褒美をあげます

# dancingFor5MinsRewardPlaceholder
source: dancing for 5 mins
es: bailar durante 5 minutos
fr: danser pendant 5 minutes
hi: 5 मिनट के लिए नृत्य करना
ja: 5分間踊る

# myLongTermRewardRewardText
source: my long term reward
es: mi recompensa a largo plazo
fr: ma récompense à long terme
hi: मेरा दीर्घकालिक पुरस्कार
ja: 長期的な報酬

# goToAMovieRewardPlaceholder
source: go to a movie
es: ir al cine
fr: aller voir un film
hi: फिल्म देखने जाएँ
ja: 映画に行く

# greatSuccessText
source: great remember true change begins within
es: Gran
fr: Formidable
hi: शानदार
ja: 素晴らしい

# someTipsSuccessText
source: some tips
es: algunos consejos
fr: quelques conseils
hi: कुछ सुझाव
ja: いくつかのヒント

# tip1title
source: easy entry point
es: punto de entrada fácil
fr: point d'entrée facile
hi: आसान प्रवेश बिंदु
ja: 簡単な入り口

# tip1description
source: begin with actions that can be completed in under two minutes, like a single push-up or jotting down a few sentences.
es: comienza con acciones que puedan completarse en menos de dos minutos, como una sola flexión o escribir algunas oraciones.
fr: commencez par des actions qui peuvent être accomplies en moins de deux minutes, comme une seule flexion ou noter quelques phrases.
hi: ऐसे क्रियाएँ शुरू करें जिन्हें आप दो मिनट से कम समय में पूरा कर सकते हैं, जैसे कि एक ही पुश-अप या कुछ वाक्य लिखना।
ja: 1つの腕立て伏せや数文を書くなど、2分以内で完了できる行動から始めましょう。

# tip2title
source: tempting pairings
es: combinaciones tentadoras
fr: combinaisons tentantes
hi: मनमोहक संयोजन
ja: 魅力的な組み合わせ

# tip2description
source: combine an enjoyable activity with one you're working on. for instance, pair your favorite podcast with your workout.
es: combina una actividad placentera con una en la que estés trabajando. por ejemplo, asocia tu podcast favorito con tu rutina de ejercicio.
fr: associez une activité plaisante à celle sur laquelle vous travaillez. Par exemple, combinez votre podcast préféré avec votre séance d'entraînement.
hi: आनंददायक क्रिया को उसके साथ जोड़ें जिस पर आप काम कर रहे हैं। उदाहरणस्वरूप, अपने पसंदीदा पॉडकास्ट को अपने व्यायाम के साथ जोड़ें।
ja: 楽しい活動と一緒に取り組むことで、例えばお気に入りのポッドキャストとトレーニングを組み合わせます。

# tip3title
source: setup for success
es: preparación para el éxito
fr: mise en place pour la réussite
hi: सफलता के लिए सेटअप
ja: 成功のためのセットアップ

# tip3description
source: arrange your environment to prompt your desired behavior. set out your exercise clothes or leave a book open to where you want to read.
es: organiza tu entorno para promover el comportamiento deseado. deja preparada tu ropa de ejercicio o deja un libro abierto en el lugar donde quieras leer.
fr: aménagez votre environnement pour favoriser le comportement souhaité. Préparez vos vêtements d'exercice à l'avance ou laissez un livre ouvert à l'endroit où vous voulez lire.
hi: अपने पर्यावरण को ऐसे व्यवस्थित करें जो आपके इच्छित व्यवहार को प्रोत्साहित करेगा। अपने व्यायाम के कपड़े तैयार रखें या वहां पर एक पुस्तक खुली रखें जहां आप पढ़ना चाहते हैं।
ja: 望む行動を促すために環境を整えましょう。トレーニング用の服を用意したり、読書したい場所に本を開いておいたりします。

# tip4title
source: future cue
es: señal para el futuro
fr: indicateur pour l'avenir
hi: भविष्य का संकेत
ja: 次のキューを設定

# tip4description
source: before concluding one task, outline the first step of your next habit to provide a smooth transition.
es: antes de concluir una tarea, describe el primer paso de tu próximo hábito para lograr una transición fluida.
fr: avant de terminer une tâche, définissez la première étape de votre prochain habitude pour assurer une transition fluide.
hi: एक काम को समाप्त करने से पहले, अपने अगले आदत के पहले कदम की रूपरेखा तैयार करें ताकि सहज संक्रमण हो सके।
ja: 前のタスクを終える前に、次の習慣の最初のステップをアウトラインして、スムーズな移行を提供します。

# tip5title
source: visible reminders
es: recordatorios visibles
fr: rappels visibles
hi: दृश्यमान अनुस्मारक
ja: 見えるリマインダー

# tip5description
source: keep your aspirations visible, whether on a board or through digital reminders on your devices.
es: mantén tus aspiraciones a la vista, ya sea en un tablero o a través de recordatorios digitales en tus dispositivos.
fr: gardez vos aspirations visibles, que ce soit sur un tableau ou à travers des rappels numériques sur vos appareils.
hi: अपने आकांक्षाओं को दृश्यमान रूप से रखें, चाहे बोर्ड पर हो या अपने उपकरणों पर डिजिटल अनुस्मारकों के माध्यम से।
ja: 目標をボードに表示したり、デバイスでデジタルリマインダーを設定するなど、目標を目に見える形で保ちます。

# tip6title
source: unity in community
es: unidad en la comunidad
fr: unité dans la communauté
hi: समुदाय में एकता
ja: 共同体の一体感

# tip6description
source: engage with a supportive group that shares your goals, fostering mutual encouragement.
es: participa en un grupo de apoyo que comparta tus objetivos, fomentando el estímulo mutuo.
fr: impliquez-vous avec un groupe de soutien partageant vos objectifs, favorisant l'encouragement mutuel.
hi: उन्हें जो आपके लक्ष्य साझा करने वाले समर्थनपूर्ण समूह में शामिल हों और साथ ही परस्पर प्रोत्साहन को बढ़ावा दें।
ja: 目標を共有する支持的なグループに参加して、互いに励まし合う雰囲気を作りましょう。

# tip7title
source: time-linked actions
es: acciones vinculadas al tiempo
fr: actions liées au temps
hi: समय-संबंधित क्रियाएँ
ja: 時間にリンクしたアクション

# tip7description
source: attach your new habit to an existing routine, such as practicing your habit right after your morning routine.
es: asocia tu nuevo hábito con una rutina existente, como practicar tu hábito justo después de tu rutina matutina.
fr: associez votre nouvelle habitude à une routine existante, comme pratiquer votre habitude juste après votre routine matinale.
hi: अपनी नई आदत को एक मौजूदा दिनचर्या के साथ जोड़ें, उदाहरणस्वरूप, सुबह की दिनचर्या के तुरंत बाद अपनी आदत का अभ्यास करें।
ja: 既存のルーティンに新しい習慣を組み込むことで、例えば朝のルーティンの後にトレーニングを行います。

# tip8title
source: routine ritual
es: ritual de rutina
fr: rituel de routine
hi: नियमित रिटुअल
ja: ルーティンの儀式

# tip8description
source: develop a brief ritual that serves as a signal for the start of your new habit, like lighting a candle before meditation.
es: desarrolla un breve ritual que sirva como señal para el inicio de tu nuevo hábito, como encender una vela antes de meditar.
fr: développez un rituel court qui sert de signal pour le début de votre nouvelle habitude, comme allumer une bougie avant la méditation.
hi: एक छोटा सा रिटुअल विकसित करें जो आपकी नई आदत की शुरुआत का संकेत मानकर काम करे, उदाहरणस्वरूप, ध्यान के लिए मोमबत्ती जलाना।
ja: 新しい習慣の開始をシグナルとする短い儀式を作ることで、例えば瞑想前にキャンドルを灯すなど。

# tip9title
source: progress tracking
es: seguimiento del progreso
fr: suivi des progrès
hi: प्रगति का परिवर्तन
ja: 進捗の追跡

# tip9description
source: utilize habit trackers to visualize your consistency and boost your motivation.
es: utiliza rastreadores de hábitos para visualizar tu constancia y aumentar tu motivación.
fr: utilisez des outils de suivi des habitudes pour visualiser votre régularité et renforcer votre motivation.
hi: नियमितता को दृश्यता देने और अपने प्रेरणा को बढ़ावा देने के लिए आदत ट्रैकर का उपयोग करें।
ja: 習慣のコンスタントさを可視化し、モチベーションを高めるために習慣トラッカーを活用します。

# tip10title
source: combining acts
es: combinación de acciones
fr: combinaison d'actions
hi: क्रियाएँ जोड़ना
ja: アクションの組み合わせ

# tip10description
source: incorporate multiple habits into one sequence, like stretching while waiting for your coffee.
es: incorpora varios hábitos en una secuencia, como estirarte mientras esperas tu café.
fr: intégrez plusieurs habitudes dans une séquence, comme vous étirer pendant que vous attendez votre café.
hi: एक अनुक्रम में कई आदतों को शामिल करें, उदाहरणस्वरूप, अपने कॉफी की प्रतीक्षा करते समय स्ट्रेचिंग को शामिल करें।
ja: コーヒーを待つ間にストレッチを行うなど、複数の習慣を一つのシーケンスに組み込むことができます。

# tip11title
source: one at a time
es: uno a la vez
fr: une à la fois
hi: एक बार में एक
ja: 一度に一つ

# tip11description
source: focus on mastering one habit before moving on to others to prevent becoming overwhelmed.
es: concéntrate en dominar un hábito antes de pasar a otros para evitar sentirte abrumado.
fr: concentrez-vous sur la maîtrise d'une habitude avant de passer à d'autres pour éviter de vous sentir submergé.
hi: एक आदत को स्वाधीन करने के बाद दूसरी आदतों पर ध्यान केंद्रित करने से अधिक व्याकुल नहीं होने दें, यह सुनिश्चित करने के लिए कि आप थक नहीं जाते।
ja: 他の習慣に取り組む前に、一つの習慣をマスターすることに焦点を当てて、過度な負担を避けましょう。

# tip12title
source: precise planning
es: planificación precisa
fr: planification précise
hi: सटीक योजना
ja: 詳細な計画

# tip12description
source: define when and where you'll perform your habit, specifying details like timing and location.
es: define cuándo y dónde realizarás tu hábito, especificando detalles como el momento y la ubicación.
fr: définissez quand et où vous allez accomplir votre habitude, en précisant les détails tels que le moment et l'endroit.
hi: यहाँ और कब आप अपनी आदत को प्रदर्शित करेंगे, इसे परिभाषित करके अपनी आदत को करने के लिए समय और स्थान का निर्धारण करें।
ja: いつどこで習慣を行うかを明確にし、タイミングや場所などの詳細を指定します。

# tip13title
source: social accountability
es: responsabilidad social
fr: responsabilité sociale
hi: सामाजिक जवाबदेही
ja: ソーシャルアカウンタビリティ

# tip13description
source: enlist the support of a friend or family member to maintain commitment to your habit.
es: solicita el apoyo de un amigo o miembro de la familia para mantener el compromiso con tu hábito.
fr: sollicitez le soutien d'un ami ou d'un membre de la famille pour maintenir votre engagement envers votre habitude.
hi: अपनी आदत के प्रति प्रतिबद्ध रहने के लिए एक दोस्त या परिवार के सदस्य का समर्थन लें।
ja: 友人や家族のサポートを得て、習慣へのコミットメントを維持します。

# tip14title
source: steady strides
es: avances constantes
fr: progrès constants
hi: नियमित कदम
ja: 着実な進歩

# tip14description
source: expect periods of slower progress, but stay dedicated as consistency is the key.
es: espera períodos de progreso más lento, pero mantente dedicado ya que la constancia es la clave.
fr: attendez-vous à des périodes de progression plus lente, mais restez déterminé car la constance est la clé.
hi: धीरे-धीरे प्रगति की अवधियों की पहुंच से आशा रखें, लेकिन प्रमाणिकता से जुड़े रहें क्योंकि यही कुंजी है।
ja: 進捗が遅く感じる期間もあるかもしれませんが、一貫性が大切です。

# tip15title
source: personal why
es: motivo personal
fr: raison personnelle
hi: व्यक्तिगत कारण
ja: 個人的な理由

# tip15description
source: discover the deeper motivations behind your habits to bolster your determination.
es: descubre las motivaciones más profundas detrás de tus hábitos para fortalecer tu determinación.
fr: découvrez les motivations profondes derrière vos habitudes pour renforcer votre détermination.
hi: अपनी आदतों के पीछे के गहरे प्रेरणाओं की खोज कर अपनी संकल्पना को मज़बूती देने के लिए।
ja: 習慣の背後にあるより深い動機を見つけ出し、決意を強化します。

# tip16title
source: celebrate effort
es: celebración del esfuerzo
fr: célébration des efforts
hi: प्रयास का सम्मान
ja: 努力の祝福

# tip16description
source: acknowledge your progress along the way, reinforcing positive emotions tied to your habits.
es: reconoce tu progreso en el camino, reforzando las emociones positivas ligadas a tus hábitos.
fr: reconnaissez votre progrès en cours de route, renforçant les émotions positives liées à vos habitudes.
hi: आपकी प्रगति को मान्यता दें जब तक आप अपनी आदतों से जुड़े सकारात्मक भावनाओं को मजबूती नहीं देते हैं।
ja: 途中での進捗を認識し、習慣に関連するポジティブな感情を強化します。

# tip17title
source: sequential stacking
es: apilamiento secuencial
fr: empilement séquentiel
hi: क्रमबद्ध स्टैकिंग
ja: 連続したスタッキング

# tip17description
source: integrate your new habit into an existing routine. for example, engage in a brief stretch after completing your morning tasks.
es: integra tu nuevo hábito en una rutina existente. por ejemplo, realiza un breve estiramiento después de completar tus tareas matutinas.
fr: intégrez votre nouvelle habitude dans une routine existante. Par exemple, faites des étirements courts après avoir terminé vos tâches matinales.
hi: अपनी नई आदत को मौजूदा दिनचर्या में शामिल करें। उदाहरणस्वरूप, सुबह के कार्यों को पूरा करने के बाद संक्षिप्त स्ट्रेच करें।
ja: 新しい習慣を既存のルーティンに統合することで、例えば朝のタスクを終えた後に短いストレッチを行います。

# tip18title
source: technological aids
es: ayudas tecnológicas
fr: aides technologiques
hi: तकनीकी सहायताएँ
ja: 技術的な支援

# tip18description
source: set alarms or make use of habit-tracking apps to serve as prompts for your actions.
es: establece alarmas o utiliza aplicaciones de seguimiento de hábitos como recordatorios para tus acciones.
fr: programmez des alarmes ou utilisez des applications de suivi des habitudes pour servir de rappels pour vos actions.
hi: अलार्म सेट करें या आदत ट्रैकिंग ऐप का उपयोग करें ताकि आपके क्रियाएँ प्रेरित हो सकें।
ja: アラームを設定したり、習慣トラッキングアプリを利用したりして、アクションのトリガーとして活用します。

# tip19title
source: regular reflection
es: reflexión regular
fr: réflexion régulière
hi: नियमित पुनरावलोकन
ja: 定期的な振り返り

# tip19description
source: periodically assess your advancement and adapt your approach as needed.
es: evalúa periódicamente tu avance y adapta tu enfoque según sea necesario.
fr: évaluez périodiquement vos progrès et adaptez votre approche si nécessaire.
hi: आपकी प्रगति का आकलन करने और आवश्यकतानुसार अपने दृष्टिकोण को अनुकूलित करने के लिए यादृच्छिक रूप से आकलन करें।
ja: 定期的に進捗を評価し、必要に応じてアプローチを適応させます。

# tip20title
source: zero inaction days
es: días de inacción cero
fr: jours sans inaction
hi: शून्य निष्क्रियता के दिन
ja: ゼロの非行動日

# tip20description
source: even on challenging days, commit to taking a step, no matter how small, to maintain momentum.
es: incluso en días desafiantes, comprométete a dar un paso, por pequeño que sea, para mantener el impulso.
fr: même les jours difficiles, engagez-vous à faire un pas, aussi petit soit-il, pour maintenir l'élan.
hi: चुनौतीपूर्ण दिनों में भी, मोमेंटम बनाए रखने के लिए एक कदम उठाने के लिए प्रतिबद्ध रहें, चाहे वह कितना भी छोटा हो।
ja: 難しい日でも、進展を保つために小さなステップを踏むことをコミットしましょう。

# tip21title
source: grouping similarities
es: agrupación de similitudes
fr: regroupement des similitudes
hi: समानताओं का समूहण
ja: 類似点のグループ化

# tip21description
source: cluster related habits to streamline your daily practice.
es: agrupa hábitos relacionados para optimizar tu práctica diaria.
fr: agroupez des habitudes similaires pour optimiser votre pratique quotidienne.
hi: दैनिक अभ्यास को सुगम बनाने के लिए संबंधित आदतों को एक साथ जोड़ें।
ja: 関連する習慣をまとめて、日々の実践を効率化します。

# tip22title
source: easy pathways
es: vías fáciles
fr: facilité des voies
hi: सुगम पथ
ja: 簡単な方法

# tip22description
source: structure your surroundings so that the simplest option aligns with your desired habit.
es: organiza tu entorno de manera que la opción más sencilla se alinee con tu hábito deseado.
fr: structurez votre environnement de sorte que l'option la plus simple soit alignée avec votre habitude souhaitée.
hi: अपने आस-पास के माहौल को ऐसे ढांचें ताकि सबसे सरल विकल्प आपकी इच्छित आदत के साथ मेल खाए।
ja: 周囲を構造化して、最も簡単な選択肢が目指す習慣と一致するようにします。

# tip23title
source: intent expression
es: expresión de intención
fr: expression d'intention
hi: इंटेंट व्यक्ति
ja: 意図の表現

# tip23description
source: state the exact time and location for your habit to reinforce your commitment. for example, "I will meditate for 10 minutes at 7 AM in my bedroom."
es: indica el momento y el lugar exactos para tu hábito para reforzar tu compromiso. por ejemplo, "Meditaré durante 10 minutos a las 7 AM en mi habitación".
fr: indiquez l'heure et le lieu exacts pour votre habitude afin de renforcer votre engagement. Par exemple, "Je méditerai pendant 10 minutes à 7 heures du matin dans ma chambre".
hi: अपनी आदत के लिए सटीक समय और स्थान की घोषणा करें ताकि आपकी प्रतिबद्धता को मज़बूती मिले। उदाहरणस्वरूप, "मैं सुबह 7 बजे मेरे बेडरूम में 10 मिनट ध्यान करूंगा।"
ja: 習慣を強化するために、正確な時刻や場所を述べます。例えば、「朝7時に寝室で10分間瞑想します」といった具体的な表現です。

# tip24title
source: imaginative rehearsal
es: ensayo imaginativo
fr: répétition imaginative
hi: कल्पनाशील पुनराभ्यास
ja: 想像力によるリハーサル

# tip24description
source: mentally envision successfully performing your habit to enhance your self-assurance.
es: imagina mentalmente realizar con éxito tu hábito para aumentar tu autoconfianza.
fr: visualisez mentalement l'exécution réussie de votre habitude pour renforcer votre confiance en vous.
hi: मानसिक रूप से अपनी आदत को सफलतापूर्वक प्रदर्शित करने की कल्पना करें ताकि आपकी आत्म-आत्मविश्वास में वृद्धि हो।
ja: 成功裏に習慣を実行する姿を心の中でイメージし、自信を高めます。

# tip25title
source: reduced resistance
es: reducción de resistencia
fr: résistance réduite
hi: संकुचित प्रतिरोध
ja: 抵抗の低減

# tip25description
source: eliminate barriers that hinder your start, such as preparing your running shoes the night before.
es: elimina las barreras que dificultan tu inicio, como preparar tus zapatillas de correr la noche anterior.
fr: éliminez les obstacles qui entravent votre démarrage, comme préparer vos chaussures de course la veille.
hi: अपनी शुरुआत को बाधित करने वाली बाधाओं को हटा दें, उदाहरणस्वरूप, रात के समय अपने दौड़ने के जूते तैयार करें।
ja: 始める際に妨げとなる要因を排除しましょう。例えば、前日にランニングシューズを用意するなど。

# tip26title
source: conscious engagement
es: compromiso consciente
fr: engagement conscient
hi: चेतन लगाव
ja: 意識的な関与

# tip26description
source: fully immerse yourself in the activity, whether it's eating, walking, or listening.
es: sumérgete por completo en la actividad, ya sea comer, caminar o escuchar.
fr: impliquez-vous pleinement dans l'activité, que ce soit manger, marcher ou écouter.
hi: खाने, चलने या सुनने जैसी क्रिया में पूरी तरह से विचलित हों।
ja: 食事、散歩、音楽鑑賞などの活動に完全に没頭してみましょう。

# tip27title
source: meaningful metrics
es: métricas significativas
fr: mesures significatives
hi: महत्वपूर्ण मापक
ja: 意義のある指標

# tip27description
source: monitor relevant indicators of your habit's progress.
es: monitorea indicadores relevantes del progreso de tu hábito.
fr: surveillez les indicateurs pertinents de la progression de votre habitude.
hi: आपकी आदत की प्रगति के प्रासंगिक सूचकों की निगरानी करें।
ja: 習慣の進捗に関連する重要な指標をモニタリングします。

# tip28title
source: enduring consistency
es: consistencia duradera
fr: cohérence durable
hi: दृढ़ एकसंगति
ja: 持続的な一貫性

# tip28description
source: continue your routine, even when the habit might feel insignificant, to build your discipline.
es: mantén tu rutina incluso cuando el hábito parezca insignificante, ya que la constancia es fundamental.
fr: maintenez votre routine même lorsque l'habitude semble insignifiante, car la constance est la clé.
hi: आपकी आदत को जारी रखें, चाहे आदत सामान्य लगे या नहीं, ताकि आपकी अनुशासन बढ़ सके।
ja: 習慣が些細に感じられるかもしれませんが、継続することで自己規律を築きます。

# tip29title
source: process acknowledgment
es: reconocimiento del proceso
fr: reconnaissance du processus
hi: प्रक्रिया स्वीकृति
ja: プロセスの認識

# tip29description
source: reward yourself for engaging consistently, regardless of immediate outcomes.
es: recompénsate por participar de manera constante, independientemente de los resultados inmediatos.
fr: récompensez-vous pour votre engagement constant, indépendamment des résultats immédiats.
hi: संयमित रूप से शामिल होने के लिए खुद को पुरस्कृत करें, चाहे तुरंत परिणाम हो या नहीं।
ja: 即時の結果に関わらず、コンスタントに取り組んだことを自己ご褒美としましょう。

# tip30title
source: affirmative language
es: lenguaje afirmativo
fr: langage affirmatif
hi: सकारात्मक भाषा
ja: 肯定的な言葉遣い

# tip30description
source: shift negative self-talk to positive reinforcement. for instance, "I'm tired, but I'll complete a brief workout."
es: cambia el diálogo interno negativo por refuerzo positivo. por ejemplo, "Estoy cansado, pero haré un breve entrenamiento".
fr: remplacez les pensées négatives par des encouragements positifs. Par exemple, "Je suis fatigué, mais je vais faire un court entraînement".
hi: नकारात्मक स्व-बातचीत को सकारात्मक पुनरावलोकन में बदलें। उदाहरणस्वरूप, "मैं थक गया हूँ, लेकिन मैं एक छोटी सी व्यायाम करूँगा।"
ja: ネガティブな自己会話をポジティブな強化に切り替えましょう。例えば、「疲れているけど、短いワークアウトを完了します」と言い換えます。
