Repository: MayurSMahajan/transformX
Catalog: lib/l10n/arb/app_*.arb
Languages: es, fr, hi, ja

# tip31title
source: segmented goals
es: objetivos segmentados
fr: objectifs segmentés
hi: विभाजित लक्ष्य
ja: 目標の細分化

# tip31description
source: break larger objectives into manageable, attainable steps.
es: divide objetivos más grandes en pasos manejables y alcanzables.
fr: divisez les objectifs plus larges en étapes gérables et atteignables.
hi: बड़े उद्देश्यों को संभावना से मिलने वाले कदमों में विभाजित करें।
ja: 大きな目標を管理可能なステップに分割します。

# tip32title
source: ceremonial pattern
es: patrón ceremonial
fr: schéma cérémonial
hi: समारोही पैटर्न
ja: 儀式的なパターン

# tip32description
source: create a sequence of actions that signify the initiation of your habit.
es: crea una secuencia de acciones que indique el inicio de tu hábito.
fr: créez une séquence d'actions qui marquent le début de votre habitude.
hi: एक क्रियाओं की अनुक्रम बनाएं जो आपकी आदत की प्रारंभिक पहचान को सूचित करती है।
ja: 習慣の開始を示す一連のアクションを作成します。

# tip33title
source: gratitude practice
es: práctica de gratitud
fr: pratique de gratitude
hi: कृतज्ञता प्रैक्टिस
ja: 感謝の実践

# tip33description
source: reflect on the positive aspects of your journey in building new habits.
es: reflexiona sobre los aspectos positivos de tu viaje para construir nuevos hábitos.
fr: réfléchissez aux aspects positifs de votre parcours pour développer de nouvelles habitudes.
hi: नई आदतें बनाने की यात्रा में सकारात्मक पहलुओं पर विचार करें।
ja: 新しい習慣を築く旅の肯定的な側面について考えることで、感謝の実践を取り入れます。

# tip34title
source: clear objectives
es: objetivos claros
fr: objectifs clairs
hi: स्पष्ट लक्ष्य
ja: 明確な目標

# tip34description
source: make your goals specific, measurable, achievable, relevant, and time-bound (SMART).
es: formula tus metas de manera específica, medible, alcanzable, relevante y con límite de tiempo (SMART).
fr: formulez vos objectifs de manière spécifique, mesurable, réalisable, pertinente et temporelle (SMART).
hi: अपने लक्ष्यों को विशिष्ट, मापनीय, संभावित, प्रासंगिक और समय-सीमित (स्मार्ट) बनाएं।
ja: 目標を具体的で測定可能、達成可能、関連性のある、時間指定された (SMART) に設定します。

# tip35title
source: embracing setbacks
es: afrontar contratiempos
fr: accepter les revers
hi: विफलताओं को गले लगाना
ja: 逆境の受け入れ

# tip35description
source: view slip-ups as opportunities for growth rather than failures.
es: considera los contratiempos como oportunidades de crecimiento en lugar de fracasos.
fr: considérez les échecs comme des opportunités de croissance plutôt que comme des échecs.
hi: हार को विकास के अवसर के रूप में देखें बजाय असफलताओं के।
ja: 失敗を成長の機会と捉えるよう心掛けましょう。

# tip36title
source: marking milestones
es: marcar hitos
fr: marquer les jalons
hi: मील के पत्थर
ja: マイルストーンの記念

# tip36description
source: recognize your accomplishments with meaningful rewards.
es: reconoce tus logros con recompensas significativas.
fr: reconnaissez vos réalisations avec des récompenses significatives.
hi: अपनी प्राप्तियों को मान्यता दें और उपयुक्त पुरस्कारों के साथ पहचानें।
ja: 意義ある報酬で成果を認識します。

# tip37title
source: daily assessment
es: evaluación diaria
fr: évaluation quotidienne
hi: दैनिक मूल्यांकन
ja: 毎日の評価

# tip37description
source: dedicate a few moments daily to review your goals and actions.
es: dedica unos momentos cada día a revisar tus objetivos y acciones.
fr: consacrez quelques instants chaque jour à passer en revue vos objectifs et actions.
hi: रोजाना कुछ क्षणों को देन के लिए आपके लक्ष्यों और क्रियाओं की समीक्षा करें।
ja: 目標と行動を振り返るために毎日少しの時間を割きます。

# tip38title
source: positive reinforcement
es: refuerzo positivo
fr: renforcement positif
hi: सकारात्मक प्रोत्साहन
ja: ポジティブな強化

# tip38description
source: associate rewards with completing your habits to reinforce positive associations.
es: asocia recompensas con completar tus hábitos para fortalecer asociaciones positivas.
fr: associez des récompenses à l'accomplissement de vos habitudes pour renforcer les associations positives.
hi: आपकी आदतों को पूरा करने के साथ पुरस्कृत करने के लिए पुरस्कार को जोड़ें ताकि सकारात्मक संबंध बढ़े।
ja: 習慣の達成に報酬を関連づけて、ポジティブな連想を強化します。

# tip39title
source: morning foundation
es: fundamento matutino
fr: fondation matinale
hi: सुबह की आधारभूतता
ja: 朝の基盤

# tip39description
source: establish a positive tone for the day through a consistent morning routine.
es: establece un tono positivo para el día a través de una rutina matutina consistente.
fr: établissez une tonalité positive pour la journée grâce à une routine matinale cohérente.
hi: नियमित सुबह की दिनचर्या के माध्यम से दिन की पॉजिटिव भावना स्थापित करें।
ja: 一貫した朝のルーティンを通じて、一日をポジティブなムードで始めます。

# tip40title
source: prioritizing rest
es: priorizar el descanso
fr: priorité au repos
hi: आराम को प्राथमिकता देना
ja: 休息の優先順位

# tip40description
source: ensure adequate sleep to sustain the energy required for habit-building.
es: asegúrate de dormir adecuadamente para mantener la energía necesaria para construir hábitos.
fr: assurez-vous de dormir suffisamment pour maintenir l'énergie nécessaire à la construction d'habitudes.
hi: आदत बनाने के लिए आवश्यक ऊर्जा को बनाए रखने के लिए पर्याप्त नींद सुनिश्चित करें।
ja: 習慣を築くために必要なエネルギーを維持するために、十分な睡眠を確保します。

# tip41title
source: gradual elevation
es: elevación gradual
fr: élévation progressive
hi: धीरे-धीरे ऊंचाइयों में वृद्धि
ja: 段階的な上昇

# tip41description
source: progressively increase the challenge level of your habit over time.
es: incrementa progresivamente el nivel de desafío de tu hábito con el tiempo.
fr: augmentez progressivement le niveau de difficulté de votre habitude au fil du temps.
hi: समय के साथ अपनी आदत के चुनौतीपूर्ण स्तर को प्रगतिशील रूप से बढ़ाते जाएं।
ja: 習慣の難易度を徐々に高めていきます。

# tip42title
source: choice reduction
es: reducción de opciones
fr: réduction des choix
hi: विकल्प संकुचन
ja: 選択肢の削減

# tip42description
source: minimize decision fatigue by narrowing your options.
es: minimiza la fatiga de decisiones al limitar tus opciones.
fr: minimisez la fatigue décisionnelle en limitant vos options.
hi: आपके विकल्पों को संकुचित करके निर्णय थकान को कम करें।
ja: 選択肢を狭めることで意思決定の疲労を軽減します。

# tip43title
source: identity formation
es: formación de identidad
fr: formation de l'identité
hi: पहचान निर्माण
ja: アイデンティティの形成

# tip43description
source: develop a self-image aligned with the habits you aim to cultivate.
es: desarrolla una imagen de ti mismo alineada con los hábitos que deseas cultivar.
fr: développez une image de vous-même en accord avec les habitudes que vous souhaitez cultiver.
hi: वे स्वरूप को विकसित करें जो आपकी आदतों के साथ मेल खाता है।
ja: 望む習慣に一致した自己像を形成します。

# tip44title
source: self-compassion practice
es: práctica de autocompasión
fr: pratique de la compassion envers soi
hi: स्व-करूणा प्रैक्टिस
ja: 自己への思いやりの実践

# tip44description
source: offer yourself kindness, particularly in the face of setbacks.
es: ofrécete amabilidad a ti mismo, especialmente ante los contratiempos.
fr: offrez-vous de la bienveillance, notamment face aux revers.
hi: खुद को मानवता दें, विशेषकर संकट के सामने।
ja: 逆境に直面したときに特に、自己に対して優しさを示します。

# tip45title
source: perseverance through plateaus
es: perseverancia a través de los estancamientos
fr: persévérance à travers les plateaux
hi: समता के माध्यम से धैर्य
ja: 停滞を乗り越える忍耐

# tip45description
source: during periods of slower progress, remain resolute and patientâ€”success is imminent.
es: durante períodos de progreso más lento, mantente firme y paciente, ya que el éxito está cerca.
fr: pendant les périodes de progrès plus lent, restez résolu et patient, le succès est imminent.
hi: धीरे-धीरे प्रगति की अवधियों में, स्थिर और धैर्यशील रहें - सफलता निकट है।
ja: 進捗が遅い期間には、忍耐強く我慢し、成功はすぐそこです。

# tip46title
source: creative triggers
es: disparadores creativos
fr: déclencheurs créatifs
hi: रचनात्मक ट्रिगर्स
ja: 創造的なトリガー

# tip46description
source: associate your habit with a unique trigger, like a specific song or a particular color, to make it more engaging.
es: asocia tu hábito con un disparador único, como una canción específica o un color particular, para que sea más atractivo.
fr: associez votre habitude à un déclencheur unique, comme une chanson spécifique ou une couleur particulière, pour la rendre plus attrayante.
hi: अपनी आदत को एक विशेष ट्रिगर के साथ जोड़ें, उदाहरणस्वरूप, एक विशिष्ट गाना या विशेष रंग, ताकि यह अधिक आकर्षक लगे।
ja: 特定の曲や特定の色など、ユニークなトリガーと習慣を関連付けることで、魅力的にします。

# tip47title
source: mindful breaks
es: pausas conscientes
fr: pauses conscientes
hi: सजग ब्रेक्स
ja: マインドフルな休憩

# tip47description
source: take short breaks throughout the day to practice mindfulness, enhancing your focus and reducing stress.
es: toma pequeñas pausas a lo largo del día para practicar la atención plena, mejorando tu enfoque y reduciendo el estrés.
fr: prenez de courtes pauses tout au long de la journée pour pratiquer la pleine conscience, améliorant votre concentration et réduisant le stress.
hi: दिनभर में मानसिकता का अभ्यास करने के लिए छोटी छोटी छुट्टियाँ लें, जिससे आपका ध्यान बढ़े और तनाव कम हो।
ja: 日中に短い休憩を取りながら、マインドフルネスを実践して集中力を高め、ストレスを軽減します。

# tip48title
source: habit checkpoints
es: puntos de control de hábitos
fr: points de contrôle des habitudes
hi: आदत चेकपॉइंट
ja: 習慣のチェックポイント

# tip48description
source: schedule regular moments to reflect on your habit progress, ensuring you're on track and making adjustments if needed.
es: programa momentos regulares para reflexionar sobre el progreso de tus hábitos, asegurándote de estar en el camino correcto y realizando ajustes si es necesario.
fr: programmez des moments réguliers pour réfléchir à la progression de vos habitudes, en vous assurant que vous êtes sur la bonne voie et en apportant des ajustements si nécessaire.
hi: आदत की प्रगति पर नियमित बार नजर डालने के लिए समय समय पर अवसर निर्धारित करें, ताकि आप यह सुनिश्चित कर सकें कि आप सही रास्ते पर हैं और जरूरत पड़ी तो सुधार कर सकें।
ja: 習慣の進捗を定期的に振り返り、進行状況を確認し、必要に応じて調整します。

# tip49title
source: growth mindset
es: mentalidad de crecimiento
fr: état d'esprit de croissance
hi: विकास मानसेत
ja: 成長マインドセット

# tip49description
source: cultivate a growth mindset by viewing challenges as opportunities to learn and improve your habits.
es: cultiva una mentalidad de crecimiento al ver los desafíos como oportunidades para aprender y mejorar tus hábitos.
fr: cultivez un état d'esprit de croissance en considérant les défis comme des opportunités pour apprendre et améliorer vos habitudes.
hi: सीखने और अपनी आदतों को सुधारने के अवसर के रूप में चुनौतियों को देखने के लिए विकास मानसेत को पोषित करें।
ja: チャレンジを学びや改善の機会と捉える成長志向を育てます。

# tip50title
source: habitual gratitude
es: gratitud habitual
fr: gratitude habituelle
hi: आदर्शग्रंथीत कृतज्ञता
ja: 習慣的な感謝

# tip50description
source: incorporate a gratitude practice into your routine, reflecting on positive aspects of your habits and accomplishments.
es: incorpora una práctica de gratitud en tu rutina, reflexionando sobre los aspectos positivos de tus hábitos y logros.
fr: intégrez une pratique de gratitude dans votre routine, en réfléchissant aux aspects positifs de vos habitudes et de vos réalisations.
hi: अपनी रुचियों और प्राप्तियों के सकारात्मक पहलुओं पर ध्यान केंद्रित करने के लिए आपकी दिनचर्या में आभार प्रैक्टिस को शामिल करें।
ja: ルーティンに感謝の実践を取り入れ、習慣や成果のポジティブな側面を考えます。
